export const mockData = [
  {
    date: new Date(2023, 2, 19),
    messages: [
      {
        date: new Date(2023, 2, 19, 11, 49),
        text: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
        author: {
          name: "Вадим",
          id: "1",
        },
      },
      {
        date: new Date(2023, 2, 19, 11, 50),
        text: "Круто! Спасибо!",
        author: {
          name: "Коля",
          id: "2",
        },
      },
    ],
  },
  {
    date: new Date(2023, 2, 20),
    messages: [
      {
        date: new Date(2023, 2, 20, 7, 49),
        text: "Привет! Как дела?",
        author: {
          name: "Вадим",
          id: "1",
        },
      },
      {
        date: new Date(2023, 2, 20, 10, 40),
        text: "Все норм! А у тебя?",
        author: {
          name: "Коля",
          id: "2",
        },
      },
      {
        date: new Date(2023, 2, 20, 11, 35),
        text: "Все путем!",
        author: {
          name: "Вадим",
          id: "1",
        },
      },
    ],
  },
  {
    date: new Date(2023, 2, 22),
    messages: [
      {
        date: new Date(2023, 2, 22, 8, 49),
        text: "Привет! Как дела?",
        author: {
          name: "Вадим",
          id: "1",
        },
      },
      {
        date: new Date(2023, 2, 22, 15, 40),
        text: "Все норм! А у тебя?",
        author: {
          name: "Коля",
          id: "2",
        },
      },
      {
        date: new Date(2023, 2, 22, 17, 35),
        text: "Все путем!",
        author: {
          name: "Вадим",
          id: "1",
        },
      },
    ],
  },
];
